In [4]:
import pandas as pd
import numpy as np

In [5]:
 dict1 = {
     "name":['harry', 'rohan', 'skillf', 'shubh'],
     "marks":[92, 34, 24, 17],
     "city":['rampur', 'beijing', 'kolkata', 'shimla']
 }

In [6]:
df = pd.DataFrame(dict1)

In [7]:
df

     name  marks     city
0   harry     92   rampur
1   rohan     34  beijing
2  skillf     24  kolkata
3   shubh     17   shimla

In [8]:
df.to_csv(' friends.csv')

In [9]:
df.to_csv('friends_index_friends.csv', index=False)

In [10]:
df.head(2)

    name  marks     city
0  harry     92   rampur
1  rohan     34  beijing

In [11]:
df.describe()

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [12]:
import os
os.chdir(r'C:\Users\vaibh\pandas')

In [13]:
vaib = pd.read_csv('vaibhav.csv')

In [14]:
vaib

   Train No2  Speed2      city2
0      23544      50     rampur
1      23546      43    kolkata
2      76874     129   bareilly
3      34567     230  antartica

In [15]:
vaib['Speed'][0] = 50

KeyError: 'Speed'

In [ ]:
vaib

In [ ]:
vaib.to_csv('vaibhav.csv')

In [16]:
vaib.index = ['first', 'second', 'third', 'fourth']

In [17]:
vaib

        Train No2  Speed2      city2
first       23544      50     rampur
second      23546      43    kolkata
third       76874     129   bareilly
fourth      34567     230  antartica

In [18]:
 ser = pd.Series(np.random.rand(23))

In [19]:
type(ser)

pandas.core.series.Series

In [20]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [21]:
newdf.head()

          0         1         2         3         4
0  0.905549  0.153226  0.307064  0.073912  0.876825
1  0.304038  0.751551  0.882408  0.586626  0.156763
2  0.884034  0.568487  0.449755  0.897168  0.100865
3  0.827464  0.979579  0.470833  0.036652  0.953735
4  0.460086  0.945669  0.854042  0.961877  0.122345

In [22]:
type(newdf)

pandas.core.frame.DataFrame

In [23]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.536490    0.519989    0.510684    0.498194    0.504784
std      0.294537    0.293086    0.290015    0.304576    0.282052
min      0.000025    0.000114    0.008705    0.000593    0.004763
25%      0.277130    0.267418    0.275393    0.224817    0.255739
50%      0.548514    0.543180    0.482066    0.486051    0.506328
75%      0.797362    0.757781    0.767839    0.786689    0.745453
max      0.999708    0.994430    0.999792    0.997602    0.995764

In [24]:
newdf.dtypes

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [25]:
newdf[0][0] = "vaibhav"

C:\Users\vaibh\AppData\Local\Temp\ipykernel_15668\2720532595.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = "vaibhav"
C:\Users\vaibh\AppData\Local\Temp\ipykernel_15668\2720532595.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'vaibhav' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "vaibhav"

In [26]:
newdf.dtypes

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [27]:
newdf.head()

          0         1         2         3         4
0   vaibhav  0.153226  0.307064  0.073912  0.876825
1  0.304038  0.751551  0.882408  0.586626  0.156763
2  0.884034  0.568487  0.449755  0.897168  0.100865
3  0.827464  0.979579  0.470833  0.036652  0.953735
4  0.460086  0.945669  0.854042  0.961877  0.122345

In [28]:
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int32', length=334)

In [29]:
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [30]:
newdf.to_numpy()

array([['vaibhav', 0.15322562572242637, 0.30706423403883154,
        0.07391180931003594, 0.876825027252624],
       [0.3040382275008221, 0.7515508749654348, 0.8824076059147122,
        0.5866256297322197, 0.15676277198079502],
       [0.8840336397391658, 0.568487249941059, 0.44975476762868905,
        0.8971676045934182, 0.10086486335476008],
       ...,
       [0.5506968053450298, 0.7387960615974186, 0.7650866322116296,
        0.9255456795066681, 0.4737585429970568],
       [0.15960177332750125, 0.720263279375169, 0.27510627316263647,
        0.1348131762752477, 0.6311631379563175],
       [0.5231356980046303, 0.6004415258037883, 0.6143986051542142,
        0.6911826614288084, 0.7374654201345078]], dtype=object)

In [31]:
 newdf[0][0] = 0.2343

In [32]:
newdf.T

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.2343,0.304038,0.884034,0.827464,0.460086,0.372075,0.55163,0.783628,0.763249,0.877994,...,0.871458,0.506534,0.206415,0.190663,0.800176,0.770895,0.563165,0.550697,0.159602,0.523136
1,0.153226,0.751551,0.568487,0.979579,0.945669,0.519282,0.993986,0.319583,0.691993,0.57785,...,0.116255,0.155111,0.01268,0.611774,0.506305,0.670444,0.76093,0.738796,0.720263,0.600442
2,0.307064,0.882408,0.449755,0.470833,0.854042,0.114339,0.602232,0.994949,0.113844,0.829631,...,0.4538,0.629306,0.808261,0.448139,0.103966,0.142115,0.890429,0.765087,0.275106,0.614399
3,0.073912,0.586626,0.897168,0.036652,0.961877,0.824115,0.035093,0.035956,0.646508,0.58399,...,0.359007,0.893594,0.064483,0.115168,0.423421,0.212498,0.952195,0.925546,0.134813,0.691183
4,0.876825,0.156763,0.100865,0.953735,0.122345,0.548696,0.360919,0.226823,0.581565,0.964175,...,0.93409,0.404315,0.631331,0.55455,0.910292,0.385724,0.632203,0.473759,0.631163,0.737465

In [33]:
newdf.head()

          0         1         2         3         4
0    0.2343  0.153226  0.307064  0.073912  0.876825
1  0.304038  0.751551  0.882408  0.586626  0.156763
2  0.884034  0.568487  0.449755  0.897168  0.100865
3  0.827464  0.979579  0.470833  0.036652  0.953735
4  0.460086  0.945669  0.854042  0.961877  0.122345

In [34]:
newdf.sort_index(axis=0, ascending=False)

            0         1         2         3         4
333  0.523136  0.600442  0.614399  0.691183  0.737465
332  0.159602  0.720263  0.275106  0.134813  0.631163
331  0.550697  0.738796  0.765087  0.925546  0.473759
330  0.563165  0.760930  0.890429  0.952195  0.632203
329  0.770895  0.670444  0.142115  0.212498  0.385724
..        ...       ...       ...       ...       ...
4    0.460086  0.945669  0.854042  0.961877  0.122345
3    0.827464  0.979579  0.470833  0.036652  0.953735
2    0.884034  0.568487  0.449755  0.897168  0.100865
1    0.304038  0.751551  0.882408  0.586626  0.156763
0      0.2343  0.153226  0.307064  0.073912  0.876825

[334 rows x 5 columns]

In [35]:
newdf2 = newdf

In [36]:
newdf2[0][0] = 9898

In [37]:
newdf.head()

          0         1         2         3         4
0      9898  0.153226  0.307064  0.073912  0.876825
1  0.304038  0.751551  0.882408  0.586626  0.156763
2  0.884034  0.568487  0.449755  0.897168  0.100865
3  0.827464  0.979579  0.470833  0.036652  0.953735
4  0.460086  0.945669  0.854042  0.961877  0.122345

In [38]:
newdf3 = newdf.copy()

In [39]:
newdf3[0][0] = 89765

C:\Users\vaibh\AppData\Local\Temp\ipykernel_15668\187970422.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf3[0][0] = 89765
C:\Users\vaibh\AppData\Local\Temp\ipykernel_15668\187970422.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf3[0][0] = 89765

In [40]:
newdf.head()

          0         1         2         3         4
0      9898  0.153226  0.307064  0.073912  0.876825
1  0.304038  0.751551  0.882408  0.586626  0.156763
2  0.884034  0.568487  0.449755  0.897168  0.100865
3  0.827464  0.979579  0.470833  0.036652  0.953735
4  0.460086  0.945669  0.854042  0.961877  0.122345

In [41]:
newdf.loc[0,0] = 6587

In [42]:
newdf.head(2)

          0         1         2         3         4
0      6587  0.153226  0.307064  0.073912  0.876825
1  0.304038  0.751551  0.882408  0.586626  0.156763

In [43]:
newdf.columns = list("ABCDE")

In [44]:
newdf.head()

          A         B         C         D         E
0      6587  0.153226  0.307064  0.073912  0.876825
1  0.304038  0.751551  0.882408  0.586626  0.156763
2  0.884034  0.568487  0.449755  0.897168  0.100865
3  0.827464  0.979579  0.470833  0.036652  0.953735
4  0.460086  0.945669  0.854042  0.961877  0.122345

In [45]:
newdf.loc[0,'A'] = 6587

In [46]:
newdf.head(2)

          A         B         C         D         E
0      6587  0.153226  0.307064  0.073912  0.876825
1  0.304038  0.751551  0.882408  0.586626  0.156763

In [47]:
newdf.loc[0,0] = 654

In [48]:
newdf.head()

          A         B         C         D         E      0
0      6587  0.153226  0.307064  0.073912  0.876825  654.0
1  0.304038  0.751551  0.882408  0.586626  0.156763    NaN
2  0.884034  0.568487  0.449755  0.897168  0.100865    NaN
3  0.827464  0.979579  0.470833  0.036652  0.953735    NaN
4  0.460086  0.945669  0.854042  0.961877  0.122345    NaN

In [49]:
newdf = newdf.drop(0, axis=1)

In [50]:
newdf.head(2)

          A         B         C         D         E
0      6587  0.153226  0.307064  0.073912  0.876825
1  0.304038  0.751551  0.882408  0.586626  0.156763

In [51]:
newdf.loc[[1,2], ['C', 'D']]

          C         D
1  0.882408  0.586626
2  0.449755  0.897168

In [52]:
newdf.loc[[1,2], :]

          A         B         C         D         E
1  0.304038  0.751551  0.882408  0.586626  0.156763
2  0.884034  0.568487  0.449755  0.897168  0.100865

In [53]:
newdf.loc[(newdf['A']<0.3) & (newdf['C']>0.1)]

            A         B         C         D         E
22   0.132023  0.548657  0.991599  0.393493  0.882281
26   0.139616  0.155230  0.537182  0.800932  0.716252
29   0.250506  0.469664  0.594819  0.314203  0.457620
32    0.27034  0.426359  0.345648  0.086406  0.557496
33   0.294377  0.994430  0.663595  0.483597  0.658138
..        ...       ...       ...       ...       ...
314  0.089545  0.058993  0.935970  0.739822  0.010404
318  0.028994  0.530891  0.658159  0.574231  0.139370
326  0.206415  0.012680  0.808261  0.064483  0.631331
327  0.190663  0.611774  0.448139  0.115168  0.554550
332  0.159602  0.720263  0.275106  0.134813  0.631163

[84 rows x 5 columns]

In [54]:
newdf.head(2)

          A         B         C         D         E
0      6587  0.153226  0.307064  0.073912  0.876825
1  0.304038  0.751551  0.882408  0.586626  0.156763

In [55]:
newdf.iloc[0,4]

0.876825027252624

In [56]:
newdf.iloc[[0,5], [1,2]]

          B         C
0  0.153226  0.307064
5  0.519282  0.114339

In [57]:
newdf.drop([1,5], axis=0, inplace=True)

In [58]:
newdf.head(4)

          A         B         C         D         E
0      6587  0.153226  0.307064  0.073912  0.876825
2  0.884034  0.568487  0.449755  0.897168  0.100865
3  0.827464  0.979579  0.470833  0.036652  0.953735
4  0.460086  0.945669  0.854042  0.961877  0.122345

In [59]:
newdf.reset_index(drop=True, inplace=True)

In [60]:
  newdf.head(3)

          A         B         C         D         E
0      6587  0.153226  0.307064  0.073912  0.876825
1  0.884034  0.568487  0.449755  0.897168  0.100865
2  0.827464  0.979579  0.470833  0.036652  0.953735

In [61]:
 newdf.loc[:,['B']] = 34

In [62]:
newdf.head(2)

          A     B         C         D         E
0      6587  34.0  0.307064  0.073912  0.876825
1  0.884034  34.0  0.449755  0.897168  0.100865

In [63]:
newdf['B'].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
327    False
328    False
329    False
330    False
331    False
Name: B, Length: 332, dtype: bool

In [64]:
df = pd.DataFrame({"name": ['Alfred', 'Batman', 'Alfred'],
                    "toy": [np.nan, np.nan, np.nan],
                   "born": [pd.NaT, pd.Timestamp("1940-04-25"),
                            pd.NaT]})

In [65]:
df.head()

     name  toy       born
0  Alfred  NaN        NaT
1  Batman  NaN 1940-04-25
2  Alfred  NaN        NaT

In [66]:
df.dropna(how = 'all', axis=1)

     name       born
0  Alfred        NaT
1  Batman 1940-04-25
2  Alfred        NaT

In [67]:
df.drop_duplicates(subset=['name'],keep= 'last')

     name  toy       born
1  Batman  NaN 1940-04-25
2  Alfred  NaN        NaT

In [68]:
 df.shape

(3, 3)

In [69]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   name    3 non-null      object
 1   toy     0 non-null      float64
 2   born    1 non-null      datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 204.0+ bytes

In [70]:
df['toy'].value_counts(dropna=False)

toy
NaN    3
Name: count, dtype: int64

In [71]:
df.isnull()

    name   toy   born
0  False  True   True
1  False  True  False
2  False  True   True

In [86]:
data= pd.read_excel('data.xlsx', sheet_name = 'Sheet2')

In [87]:
data.iloc[0, 0] = 34

In [88]:
data

   Train No2  Speed2      city2
0         34      50     rampur
1      23546      43    kolkata
2      76874     129   bareilly
3      34567     230  antartica

In [90]:
data.to_excel('data.xlsx', sheet_name= 'Sheet2')